import os
from dotenv import load_dotenv
from datetime import timezone, timedelta

# Загружаем токен из .env
load_dotenv()
DISCORD_BOT_TOKEN = os.getenv("DISCORD_BOT_TOKEN")

BOT_PREFIX = "!"
msk_tz = timezone(timedelta(hours=3))
DEFAULT_EMPLOYMENT_RANK = "Водитель скорой помощи"

# --- ОСНОВНЫЕ РОЛИ ---
SENIOR_STAFF_ROLES = [1248561760793919595, 1248561760793919594, 1249669778055106560, 1249670005126332458, 1450607164409385123] # Роли старшего состава
ROLES_EMPLOYMENT =[1259175313267753101, 1248601283389034550, 1248601284274294868] # Выдаются при трудоустройстве
ROLES_STATE_EMP =[1467208101278257315] # Выдаются гос. сотрудникам
ROLE_AFTER_DISMISSAL = 1248601603481669712 # При увольнении
BLACKLIST_ROLE_ID = 1248601833392443472 # При увольнении с ЧС

# --- КАНАЛЫ ЗАЯВОК И ЛОГОВ (КАДРОВЫЙ АУДИТ) ---
HR_SETUP_CHANNEL_ID = 1248561761666469956
REQUESTS_CHANNEL_ID = 1248561761666469956 # Сюда падают заявки на трудоустройство
DISMISS_REQUESTS_CHANNEL_ID = 1248561764220801046 # Заявки на увольнение
LOG_CHANNEL_ID = 1248561764220801051 # Логи кадрового аудита
BLACKLIST_CHANNEL_ID = 1248561763419422753 # Логи Черного списка
BLACKLIST_PING_ROLES =[1248561760793919598, 1248561760823152711] # Пинг администрации при внесении в ЧС

# --- НАСТРОЙКИ ВЗЫСКАНИЙ ---
PUNISHMENT_SETUP_CHANNEL_ID = 1248561764220801053 # Канал взысканий
PUNISHMENT_LOG_CHANNEL_ID = 1248561764220801053 # Канал логов взысканий
PUNISHMENTS_ROLES = {
    "Предупреждение 1/3": 1267524399792128081,
    "Предупреждение 2/3": 1358047912311128084,
    "Выговор 1/2": 1248601604408479804,
    "Выговор 2/2": 1248601603896770581,
    "Переаттестация": 1401243480302419988
}
# ID ролей взысканий
PUNISHMENT_W1_ID = 1267524399792128081 # Предупреждение 1/3
PUNISHMENT_W2_ID = 1358047912311128084 # Предупреждение 2/3
PUNISHMENT_R1_ID = 1248601604408479804 # Выговор 1/2
PUNISHMENT_R2_ID = 1509274681423695934 # Выговор 2/2

PUNISHMENTS_ROLES = {
    "Предупреждение 1/3": PUNISHMENT_W1_ID,
    "Предупреждение 2/3": PUNISHMENT_W2_ID,
    "Выговор 1/2": PUNISHMENT_R1_ID,
    "Выговор 2/2": PUNISHMENT_R2_ID
}


# --- НАСТРОЙКИ ПОСТАВОК ---
SUPPLY_SETUP_CHANNEL_ID = 1469659534942277652 # Канал для поставок
SUPPLY_LOG_CHANNEL_ID = 1469659534942277652 # Канал запросов поставок 
SUPPLY_PING_ROLE_ID = 1456265963753312440 # Роль для пинга поставщиков
SUPPLY_REPORT_CHANNEL_ID = 1456267339589877913 # отчеты о поставках
CHIEF_DOCTOR_ROLE_ID = 1248561760793919595 # Роль ГВ 
SUPPLY_WORKER_ROLES =[1249670005126332458, 1450607164409385123, 1456265963753312440, 1249669778055106560] # Кто может быть ответственным/помощником

# --- НАСТРОЙКИ ОТДЕЛОВ ---
DEPT_SETUP_CHANNEL_ID = 1508511205520703608 # Канал для заявок в отделы

# --- КАНАЛЫ ЗАЯВОК В ОТДЕЛЫ ---
DEPT_REQUESTS_CHANNELS = {
    "БСМП": 1248561765059399800, # Вставьте ID канала заявок для БСМП
    "АБ": 1358031660536561824,   # Вставьте ID канала заявок для АБ
    "КУЦ": 1248561764606541900,  # Вставьте ID канала заявок для КУЦ
    "КДО": 1498067518810619965   # Вставьте ID канала заявок для КДО
}

TRANSFER_REQUESTS_CHANNEL_ID = 1248561765059399802

DEPT_PING_ROLES = {
    "БСМП":[1248561760793919589, 1248561760756305966], # Пинг Зав/Зам БСМП 
    "АБ":[1248561760756305967, 1248561760793919590],   # Пинг Зав/Зам АБ 
    "КУЦ": [1248561760793919592, 1248561760756305969],   # Пинг Зав/Зам КУЦ 
    "КДО": [1498057353516548107, 1498057398470967406]   # Пинг Зав/Зам КДО
}
DEPARTMENTS_ROLES = {
    "О": 1259175313267753101,
    "БСМП": 1248561760693387360, 
    "АБ": 1248561760693387359,   
    "КУЦ": 1248561760693387361,
    "КДО": 1498070670603718728  
}
SENIOR_DEPT_ROLES = {
    "БСМП": 1487867734263074826, # Роль Старший БСМП 
    "АБ": 1413466736619163679,   # Роль Старший АБ
    "КУЦ": 1256946208937611274,   # Роль Старший КУЦ 
    "КДО": 1498057151980114040 # Роль Старший КДО
}

# --- ПИНГИ (УПОМИНАНИЯ) ПРИ ЗАЯВКАХ ---
# Укажите ID ролей через запятую, кого нужно тегать при новых заявках:
PING_EMPLOYMENT =[1248561760793919592, 1248561760756305969] # Зав. отделением и Зам. зав. отделением
PING_STATE_EMP =[1248561760793919595, 1248561760793919594] # Глав. Врач, Зам. Глав. Врача
PING_RESIGNATION =[1249670005126332458, 1450607164409385123, 1248561760793919595, 1248561760793919594] # Глав. Врач, Зам. Глав. Врача, Зав. отделением, Зам. зав.

# --- ПРОЧИЕ НАСТРОЙКИ ---
DEFAULT_EMPLOYMENT_RANK = "Водитель скорой помощи"
BOT_PREFIX = "!"
msk_tz = timezone(timedelta(hours=3))

# --- НАСТРОЙКИ ИНСТРУКТАЖЕЙ ---
INSTRUCTION_SETUP_CHANNEL_ID = 1487152626343874721 # Канал, где будет висеть кнопка "Запросить инструктаж"
INSTRUCTION_REQUESTS_CHANNEL_ID = 1487152626343874721 # Канал, куда падают логи запросов на проверку СС

INSTRUCTION_TYPES = [
    "Вступительный инструктаж",
    "Экскурсия по ЦГБ №3 и дать клятву Российского врача",
    "Инструктаж на должность Санитар",
    "Инструктаж по выдаче мед. книжки",
    "Инструктаж по выдаче справки от нарколога"       
]

# --- НАСТРОЙКИ ОТЧЕТОВ НА ПОВЫШЕНИЕ ---
REPORT_SETUP_CHANNEL_ID = 1511407049836204193 # Канал, где будет кнопка !setup для отчетов

# Каналы ОЧЕРЕДИ на повышение (Сюда падают одобренные отчеты для выдачи роли Старшим составом)
PROMOTION_QUEUE_CHANNELS = {
    "БСМП": 1456352483122086030,
    "АБ": 1456351572102742077,
    "КУЦ": 1455335007756488795,
    "КДО": 1498060515379904635,
    "О": 1263223777781878905
}

# Каналы, куда падают сами отчеты для проверки главами отделов
REPORT_REQUESTS_CHANNELS = {
    "БСМП": 1248561765831147607,
    "АБ": 1248561765537812488,
    "КУЦ": 1248561765537812482,
    "КДО": 1498060400179286187,
    "О": 1248603820762857522
}

# === СИСТЕМА РАНГОВ ===
RANK_SYSTEM =[
    {"rank_num": 1, "name": "Водитель скорой помощи", "main_role": 1248601283389034550, "extra_roles": [1248601284274294868,1259175313267753101], "is_senior": False},
    {"rank_num": 2, "name": "Фармацевт", "main_role": 1248601282919534652, "extra_roles":[1248601284274294868,1259175313267753101], "is_senior": False},
    {"rank_num": 3, "name": "Санитар", "main_role": 1248601282348978176, "extra_roles":[1248601284274294868,1464908550412173505], "is_senior": False, "set_prefix": "ВБО"},
    {"rank_num": 4, "name": "Фельдшер", "main_role": 1248601281526759534, "extra_roles":[1248601284274294868,], "is_senior": False},
    {"rank_num": 5, "name": "Ординатор 1-го года", "main_role": 1248601280809537620, "extra_roles":[1248601284274294868,], "is_senior": False},
    {"rank_num": 6, "name": "Ординатор 2-го года", "main_role": 1248601280591564850, "extra_roles":[1248601284274294868,], "is_senior": False},
    {"rank_num": 7, "name": "Врач второй категории", "main_role": 1248601279610093609, "extra_roles":[1248601284274294868,], "is_senior": True},
    {"rank_num": 8, "name": "Врач первой категории", "main_role": 1248601279102582875, "extra_roles":[1248601284274294868,], "is_senior": True},
    {"rank_num": 9, "name": "Врач высшей категории", "main_role": 1248601278465183754, "extra_roles":[1248601284274294868,], "is_senior": True}
]
